app/controllers/relevamientos_controller.rb

  def index
    @relevamientos = Relevamiento.all
---
SELECT `relevamientos`.* FROM `relevamientos`