app/controllers/role_permissions_controller.rb

  def show
    @role_permission = RolePermission.find(params[:id])
---
SELECT "role_permissions".* FROM "role_permissions" WHERE "role_permissions"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    prepare
    @role_permission = RolePermission.find(params[:id])
---
SELECT "role_permissions".* FROM "role_permissions" WHERE "role_permissions"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @role_permission = RolePermission.new(params[:role_permission])

    respond_to do |format|
      if @role_permission.save
---
INSERT INTO "role_permissions" ("conduct", "created_at", "regulator", "role_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["conduct", "index"], ["created_at", Wed, 11 Apr 2012 15:14:25 UTC +00:00], ["regulator", "roles"], ["role_id", 1], ["updated_at", Wed, 11 Apr 2012 15:14:25 UTC +00:00]]

  def update
    @role_permission = RolePermission.find(params[:id])

    respond_to do |format|
      if @role_permission.update_attributes(params[:role_permission])
---
SELECT "role_permissions".* FROM "role_permissions" WHERE "role_permissions"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "role_permissions" SET "regulator" = 'role_permissions', "conduct" = 'index', "updated_at" = '2012-04-24 18:04:40.378882' WHERE "role_permissions"."id" = 18

  def destroy
    @role_permission = RolePermission.find(params[:id])
    @role_permission.destroy
---
SELECT "role_permissions".* FROM "role_permissions" WHERE "role_permissions"."id" = ? LIMIT 1  [["id", "9"]]
DELETE FROM "role_permissions" WHERE "role_permissions"."id" = ?  [["id", 9]]