app/views/relevamientos/_form.html.erb

SELECT `tipo_de_documentos`.* FROM `tipo_de_documentos`
---
        <div class="controls">
          <%= f.collection_select(:tipo_de_documento_id, TipoDeDocumento.all, :id, :nombre) %>

SELECT `escuelas`.* FROM `escuelas`
---
        <div class="controls">
          <%= f.collection_select(:escuela_id, Escuela.all, :id, :to_s) %>